Revit 2027 API
EnergyAnalysisDetailModelOptions.EnergyModelType Property
Note: This API is now obsolete.
 It indicates whether the energy model is based on rooms/spaces or building elements.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
[ObsoleteAttribute("EnergyModelType is deprecated in Revit 2027 and will be removed in the next version of Revit. The Mode set in Energy Settings will be used. The mode can be set with EnergyDataSettings.GetEnergyDataSettings(revitDoc).AnalysisType.")]
public EnergyModelType EnergyModelType { get; set; }
<ObsoleteAttribute("EnergyModelType is deprecated in Revit 2027 and will be removed in the next version of Revit. The Mode set in Energy Settings will be used. The mode can be set with EnergyDataSettings.GetEnergyDataSettings(revitDoc).AnalysisType.")>
Public Property EnergyModelType As EnergyModelType
	Get
	Set
public:
[ObsoleteAttribute(L"EnergyModelType is deprecated in Revit 2027 and will be removed in the next version of Revit. The Mode set in Energy Settings will be used. The mode can be set with EnergyDataSettings.GetEnergyDataSettings(revitDoc).AnalysisType.")]
property EnergyModelType EnergyModelType {
	EnergyModelType get ();
	void set (EnergyModelType value);
}
[<ObsoleteAttribute("EnergyModelType is deprecated in Revit 2027 and will be removed in the next version of Revit. The Mode set in Energy Settings will be used. The mode can be set with EnergyDataSettings.GetEnergyDataSettings(revitDoc).AnalysisType.")>]
member EnergyModelType : EnergyModelType with get, set
Property Value
EnergyModelType
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Remarks
 The default value is EnergyModelType::AnalysisMode.
See Also
Reference
EnergyAnalysisDetailModelOptions Class
Autodesk.Revit.DB.Analysis Namespace